package studymyself;

public class baseballgame {
	// 1. 컴퓨터가 3자리 정수를 랜덤하게 생성함
	// 2. 각각 자리에 수를 넣고 각자리별로 일치여부 검사
	// 3. 사용자가 입력값을 받기 - 3자리 정수
	// 4. 컴퓨터가 생성한 숫자와 사용자가 입력한 숫자를 비교
	//    각 요소를 비교하여 자리값과 숫자가 일치하는지 판단(자리수 = 숫자)
	//    자리값과 숫자가 동시에 일치하면 스트라이크 변수 값을 증가
	//    자리값과 숫자가 다른자리에서 일치하면 볼 변수 값을 증가
	// 5. 판정 결과를 화면에 출력
	// ? strike, ? ball
	
	// 6. 3S이면 경기를 종료, 아니면 반복
	
	
	int num1 = (int)(Math.random()*9+1);
	int num2 = (int)(Math.random()*9+1);
	int num3 = (int)(Math.random()*9+1);
	
	
	
}
